{"inkVersion":21,"root":[[["^Greetings, stranger. Do you require assistance on your journey?","\n","ev","str","^Greetings! I'm actually here on a quest, and I'm seeking some guidance.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Hello! I'm just exploring the area, but a bit of guidance wouldn't hurt.","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^Ah, a quest, you say? What kind of guidance do you seek?","\n",["ev","str","^I've recently met the princess by the sea, and now I'm headed to the Dragon Village. Can you help me with directions?","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^I'm on a mission to the Dragon Village. Could you provide me with directions on how to get there?","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^Ah, the princess by the sea... She's made quite an impression. To reach the Dragon Village, you'll need to cross the bridge beyond the village. Follow the path through the forest—it will lead you to the heart of the village.","\n",["ev","str","^Thank you for your guidance. I'll follow that path.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ","<>","\n",{"->":"0.g-1"},{"#f":5}]}],{"#f":5}],"c-1":["\n","^There isn't much to say. We are just restless.","\n",["ev","str","^I can understand. Thank you for your assistance. Farewell.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ","<>","^ ","\n",{"->":"0.g-1"},{"#f":5}]}],{"#f":5}]}],{"#f":5}],"c-1":["\n","^Exploring, are you? Well, our village is a place of stories and secrets. Do you need any directions?","\n",["ev","str","^I've recently met the princess by the sea, and now I'm headed to the         Dragon     Village. Can you assist me with directions?","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^I'm actually on a quest to reach the Dragon Village. Could you provide me with some guidance?","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ","\n","^Ah, the princess by the sea. Her presence leaves a mark. To reach the Dragon Village, cross the bridge beyond the village and follow the path through the forest. It will lead you to the village's heart.","\n",["ev","str","^Thank you for your help. I'll follow that path.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ","<>","\n",{"->":"0.g-1"},{"#f":5}]}],{"#f":5}],"c-1":["\n","^To reach the Dragon Village, cross the bridge beyond the village and follow the path through the forest.","\n",["ev","str","^Thank you for your help. I'll follow that path.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ","<>","\n",{"->":"0.g-1"},{"#f":5}]}],{"#f":5}]}],{"#f":5}],"#f":5,"#n":"g-0"}],{"g-1":["^Safe travels. May your quest be successful.","\n",["end",["done",{"#f":5,"#n":"g-3"}],{"#f":5,"#n":"g-2"}],{"#f":5}]}],"done",{"#f":1}],"listDefs":{}}